backend/controllers/ModelHistoryController.php

SELECT * FROM `modelhistory` WHERE `id`='2694'
---
    protected function findModel($id)
    {
        if (($model = ModelHistory::findOne($id)) !== null) {