backend/views/full-timer/index.php

SELECT * FROM `full_timer_jabatan` WHERE `id`=1
SELECT * FROM `full_timer_jabatan`
---

            //'id',
            //'gelar_depan',
            [
                'attribute' => 'jabatan_id',
                'value' => 'jabatan.nama',
                'format' => 'raw',
                'filter' => ArrayHelper::map(
                                FullTimerJabatan::find()->asArray()->all(),
                                'id', 'nama')
            ],